СМП_ОнлайнОбменДанными/cfe/src/Catalogs/СМП_ПравилаСверки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>СМП_ПравилаСверки</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ПравилаКонвертацииОбъектов</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СМП_ВидыПоказателейСверки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Реквизит</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Свойства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выражение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Допуск</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Информативный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отключить</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

СМП_ОнлайнОбменДанными/cfe/src/Enums/СМП_ВидыСвойств.xml
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СМП_ВидыСвойств</name>
  <enumValues>
    <name>ВидыСубконтоСчета</name>
  </enumValues>
  <enumValues>
    <name>Измерение</name>
  </enumValues>
  <enumValues>
    <name>НаборДвиженийРегистраБухгалтерии</name>
  </enumValues>
  <enumValues>
    <name>НаборДвиженийРегистраНакопления</name>
  </enumValues>
  <enumValues>
    <name>НаборДвиженийРегистраРасчета</name>
  </enumValues>
  <enumValues>
    <name>НаборДвиженийРегистраСведений</name>
  </enumValues>
  <enumValues>
    <name>НаборЗаписейПодчиненногоРегистраСведений</name>
  </enumValues>
  <enumValues>
    <name>НаборЗаписейПоследовательности</name>
  </enumValues>
  <enumValues>
    <name>ПодчиненныйСправочник</name>
  </enumValues>
  <enumValues>
    <name>Реквизит</name>
  </enumValues>
  <enumValues>
    <name>Ресурс</name>
  </enumValues>
  <enumValues>
    <name>Свойство</name>
  </enumValues>
  <enumValues>
    <name>СоставПланаОбмена</name>
  </enumValues>
  <enumValues>
    <name>ТабличнаяЧасть</name>
  </enumValues>
  <enumValues>
    <name>ЭлементСоставаПланаОбмена</name>
  </enumValues>
</mdclass:Enum>

СМП_ОнлайнОбменДанными/cfe/src/Enums/СМП_ВидыПоказателейСверки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СМП_ВидыПоказателейСверки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Реквизит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выражение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

СМП_ОнлайнОбменДанными/cfe/src/Catalogs/СМП_ПравилаСверки/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьПараметрыВыбораРеквизита();
	УстановитьВидимость(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидПриИзменении(Элемент)
	
	УстановитьВидимость(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Элемент.ТекстРедактирования, ЭтотОбъект, "Объект.Комментарий");
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьПараметрыВыбораРеквизита()
	
	мПараметрыВыбора = Новый Массив;
	мПараметрыВыбора.Добавить(Новый ПараметрВыбора("Отбор.Владелец",
	СМП_ОнлайнОбменСверка.ОбъектСвоейБазы(Объект.Владелец)));
	мПараметрыВыбора.Добавить(Новый ПараметрВыбора("Отбор.Вид", Перечисления.СМП_ВидыСвойств.Реквизит));
	Элементы.Реквизит.ПараметрыВыбора = Новый ФиксированныйМассив(мПараметрыВыбора);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ЭтоВидВыражение(Вид)
	
	Возврат Вид = ПредопределенноеЗначение("Перечисление.СМП_ВидыПоказателейСверки.Выражение");
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимость(Форма)
	
	ВидВыражение = ЭтоВидВыражение(Форма.Объект.Вид);
	Форма.Элементы.Выражение.Видимость = ВидВыражение;
	Форма.Элементы.Реквизит.Видимость = Не ВидВыражение;
	
КонецПроцедуры

#КонецОбласти
